#⭐ Звёздочка — обмен значений. Продемонстрировать обмен значений двух переменных (a, b = b, a)
# и объяснить комментарием, почему это работает без временной переменной.
# Затем показать, что то же самое «схвачено» кортежем в виде a, b = (b, a)
# и что при этом происходит справа (какой объект создаётся). Напишите пояснение в 2–3 предложения.

a, b = 50, 80
b, a = a, b
print(f"a = {a}, b = {b}")
#получается сделать без третьей переменной, потому что в первой строке создается кортеж,
#а во второй он распаковывается

a, b = (b, a)
print(f"a = {a}, b = {b}")
#было два одиночных значения, а сейчас мы снова создаем кортеж, поменяв их местами
#вариант, если все-таки нужно изменить кортеж: распаковать, сделать изменения, потом снова создать кортеж