from dataclasses import dataclass, asdict


#⭐⭐ Звёздочка (продвинутая) — dataclasses.dataclass. Самостоятельно изучите по официальной документации
# Python декоратор @dataclass из модуля dataclasses и коротко (3–4 предложения) опишите,
# чем он похож на namedtuple и чем отличается: mutability, значения по умолчанию,
# поддержка type hints, наличие asdict(). Приведите маленький пример класса Post
# через @dataclass и укажите, в каких случаях вы выбрали бы dataclass, а в каких — namedtuple.

#@dataclass позволяет создавать именованные кортежи, но, в отличие от namedtuple он изменяемый
#значение по умолчанию: если пользователь не ввел данные, то будет введено значение по умолчанию
#type hints - подсказки, какой тип данных должен быть у элемента (имя - строка, возраст - число)
#важно! это подсказка, тип вводимых данных не проверяет!
#asdict() - функция, которая преобразует объект, созданный с помощью @dataclass, в обычный словарь (dict)

@dataclass
class Post:
    title: str
    category: str
    year: int = 2026 #задается значение по умолчанию

post = Post("Что едят манулы", "Манулы")

print(post) #я указала два значения из трех, но он не выдал ошибку, а поставил значение по умолчанию

post.year = 2025
print(post) #изменил 2026 год на 2025

new_dict = asdict(post) #преобразовал кортеж в словарь со списком ключ-значение
print(new_dict)

#dataclass лучше использовать при работе с внешними данными (ввел пользователь или получены из файла JSON),
#а namedtuple - при работе с базами данных
