#*Распаковка и *rest.** Дан кортеж numbers = (10, 20, 30, 40, 50).
# Распаковать: первое число, «середину» через *middle и последнее число. Вывести их.
# Затем распаковать строку name = "Иван" в first, *rest и напечатать результат.

numbers = (10, 20, 30, 40, 50)
first, *middle, last = numbers
print(f"Первый элемент: {first}, Середина: {middle}, Последний элемент: {last}")

name = "Иван"
first, *rest = name #в случае со строкой он в переменную first кладет первую букву слова, остальное - в rest
print(first, rest)
