import csv
from pathlib import Path


# Звёздочка (продвинутая). Самостоятельно изучите csv.DictReader и csv.DictWriter
# по официальной документации Python. Напишите программу, которая читает blog.csv с помощью DictReader
# и выводит список книг с фильтром (например, только те, где просмотры > 100).
# Либо — изучите, как читать большой файл построчно через for line in f: вместо readlines(),
# и напишите программу, которая считает количество строк в большом лог-файле, не загружая его целиком в память.
# Сравните два подхода и объясните, почему построчный выигрышен для больших файлов

# csv.DictReader — читает строки CSV-файла и преобразует каждую в словарь dict.
# csv.DictWriter — записывает словари в CSV-файл.
# fieldnames — определяет названия и порядок столбцов.

# Выводит статьи, если просмотров больше 100
with open("blog.csv", "r", encoding="cp1251", newline="") as file:
    reader = csv.DictReader(file)
    for row in reader:
        if int(row["views"]) > 100:
            print(f"{row['title']} - {row['author']} - {row['views']} просмотров")


# Чтение многостраничного файла через readlines()
with open("example.txt", "r", encoding="utf-8") as file:
    lines = file.readlines()
    print(f"Количество строк в файле - {len(lines)}")

# Чтение многостраничного файла через for line in f
with open("example.txt", "r", encoding="utf-8") as file:
    count = 0
    for line in file:
        count += 1
    print(f"Количество строк: {count}")

# В первом случае создается список всех строк, во втором - список всех строк не создается.
# Python читает файл постепенно, используя буфер, поэтому расход памяти остаётся небольшим
# даже при большом количестве строк. Кстати, пустые строки он тоже считает)