#**Меню блога (список постов).** Заведите список постов — каждый пост это список
# `[дата, заголовок, категория]` (дата в формате `ГГГГ-ММ-ДД`).
# Выведите все посты, отсортируйте их по дате, а затем отфильтруйте по введённой с клавиатуры категории.
# Если в этой категории постов нет — выведите сообщение об этом.

posts = [
    ["2026-05-15", "Изучаем Python: программирование игр, визуализация данных, веб-приложения", "Python"],
    ["2026-02-14", "Автоматизация рутинных задач с помощью Python", "Python"],
    ["2026-09-14", "Выразительный Javascript", "Java"],
    ["2026-03-08", "Грокаем алгоритмы: иллюстрированное пособие для программистов и любопытствующих", "Алгоритмы"],
    ["2026-08-18", "Изучаем программирование на Python", "Python"],
]

#выводим все посты
print(f"\nВсе посты:")
for post in posts:
    print(f"Дата: {post[0]}, Название поста: {post[1]}, Категория: {post[2]}")

#сортируем посты по дате
print(f"\nПосты, отсортированные по дате:")
posts.sort()
for post in posts:
    print(f"Дата: {post[0]}, Название поста: {post[1]}, Категория: {post[2]}")
    
#отфильтровать по введенной с клавиатуры категории
target = input("\nПо какой категории отфильтровать? ")
filtered = [post for post in posts if post[2] == target]

if filtered:
    print(f"\nНайденные посты:")
    for post in filtered:
        print(f"Дата: {post[0]}, Название поста: {post[1]}, Категория: {post[2]}")
else:
    print("Постов в выбранной категории нет")
