#**Список чисел и статистика.** Создайте список из 6–8 чисел (например, баллы за тест). Выведите сумму (`sum`),
# минимальное и максимальное значение, среднее (`сумма / длина`) и список, отсортированный по убыванию.

test_scores = [67, 78, 34, 54, 102, 4, 87, 76]
print(f"Сумма всех баллов: {sum(test_scores)}")
print(f"Минимальный балл: {min(test_scores)}")
print(f"Максимальный балл: {max(test_scores)}")
print(f"Средний балл: {sum(test_scores)/len(test_scores)}")

test_scores.sort(reverse=True)
print(f"Сортированный по убыванию список: {test_scores}")