#**Звёздочка (самостоятельное изучение `key=lambda`).** Изучите по официальной документации Python,
# как работает `sorted(..., key=...)` и что такое `lambda`. Отсортируйте список постов из задачи 3:
# а) по длине заголовка; б) по категории (по алфавиту); в) по заголовку в обратном порядке.
# Объясните комментарием в коде, что возвращает `key`-функция в каждом случае.

posts = [
    ["2026-05-15", "Изучаем Python: программирование игр, визуализация данных, веб-приложения", "Python"],
    ["2026-02-14", "Автоматизация рутинных задач с помощью Python", "Python"],
    ["2026-09-14", "Выразительный Javascript", "Java"],
    ["2026-03-08", "Грокаем алгоритмы: иллюстрированное пособие для программистов и любопытствующих", "Алгоритмы"],
    ["2026-08-18", "Изучаем программирование на Python", "Python"],
]

#выводим все посты
print(f"\nВсе посты:")
for post in posts:
    print(f"Дата: {post[0]}, Название поста: {post[1]}, Категория: {post[2]}")

#отсортировать посты по длине заголовка
print(f"\nПосты, отсортированные по длине заголовка:")
posts_sorted_len = sorted(posts, key=lambda post: len(post[1]))
for post in posts_sorted_len:
    print(f"Дата: {post[0]}, Название поста: {post[1]}, Категория: {post[2]}")

#отсортировать посты по категории по алфавиту
print(f"\nПосты, отсортированные по категории по алфавиту:")
posts_sorted_kategory = sorted(posts, key=lambda post: min(post[2]))
for post in posts_sorted_kategory:
    print(f"Дата: {post[0]}, Название поста: {post[1]}, Категория: {post[2]}")

#отсортировать посты по заголовку в обратном порядке
print(f"\nПосты, отсортированные по заголовку в обратном порядке:")
posts_sorted_header = sorted(posts, key=lambda post: post[1], reverse=True)
for post in posts_sorted_header:
    print(f"Дата: {post[0]}, Название поста: {post[1]}, Категория: {post[2]}")

#в первом случае key возвращает длину каждого заголовка для post[1],
# во втором - номер первой буквы в таблице символов для post[2],
# в третьем - тоже номер первой буквы в таблице символов, но в обратном порядке для post[1]