#**Звёздочка ★ — сумма и произведение через цикл.** Напишите программу, которая считает
# **произведение чисел от 1 до `n`** (факториал `n!`) через `for`.
# Например, для `n = 5` получится `1*2*3*4*5 = 120`.
# Затем **дополнительно** выведите через **вложенные циклы** (цикл внутри цикла)
# таблицу умножения `from 1 to 5` в виде строк. Подсказка: внешний цикл — по множителю `i`, вложенный — по `j`.

number = 5
num = 1

for i in range(1, number+1):
    num = num * i
    print(num)
    for j in range(1, number+1):
        print (f"Произведение {i} * {j} = {i * j}")

print(f"Факториал числа {number} = {num}")
