# **Звёздочка ★ — `else` в циклах.** Самостоятельно **изучите блок `else` в циклах**
# (в официальной документации или в разделе 4 выше). Напишите программу, которая ищет заданное число
# в списке: если нашла — выводит «Нашли» и `break`, а если **не нашла ни одного совпадения**
# — выводит «Не нашли» через `else` у цикла. Объясните комментарием, почему `else`
# выполнился (или не выполнился).

number = 8
list = [4, 9, 7, 15, 18, 10]

for num in list:
    if num == number:
        print(f"Число {8} есть в списке")
        break
else:
    print(f"Числа {8} нет в списке")

#Если в списке list есть число 8, то выполняется цикл и break, поэтому не выполняется else
#Если в списке list нет числа 8, то break не выполняется, поэтому выполняется else