#**Оценки по порогам.** Дан список оценок, например `[95, 88, 60, 42, 100]`.
# Пройтись по нему `for`-циклом и вывести для каждой оценки вердикт:
# `>= 90` — «отлично», `>= 70` — «хорошо», `>= 50` — «удовлетворительно», иначе — «неудовлетворительно».
# Использовать `if/elif/else` внутри цикла.

estimation = [95, 88, 60, 42, 100, 15, 200]

for number in estimation:
    if number >= 90:
        print(f"Оценка отлично: {number}")
    elif number >=  70:
        print(f"Оценка хорошо: {number}")
    elif number >=  50:
        print(f"Оценка удовлетворительно: {number}")
    else:
        print(f"Оценка неудовлетворительно: {number}")
