#**Сумма введённых чисел до нуля.** Программа вводит числа (`int(input(...))`)
# до тех пор, пока пользователь не введёт `0`, а затем выводит сумму всех введённых чисел.
# Использовать `while` и `break`. Подсказка: накапливайте сумму в переменной, а `0` — сигнал остановки.

sum = 0

while True:
    number = int(input("Введите число от 0 до 10 "))

    if number != 0:
        sum += number
        print(f"Введено число: {number}")
        continue
    
    print(f"Сумма всех введенных чисел: {sum}")
    break
