#Палиндром. Проверить, является ли строка палиндромом
# (читается одинаково с обеих сторон, игнорируя регистр и пробелы/знаки).
# Подсказка: убрать пробелы и знаки препинания, привести к нижнему регистру,
# сравнить строку с её переворотом s[::-1]. Примеры: "А роза упала на лапу Азора" → True; "Привет" → False.

text1 = "А роза упала на лапу Азора"
text1 = text1.lower()
text1 = text1.replace(" ", "")

text2 = text1[::-1]

if text1 == text2:
    print(f"Палиндромы: текст 1 {text1} и текст 2 {text2}")
else:
    print(f"Не палиндромы: текст 1 {text1} и текст 2 {text2}")
