#Счётчик слов. Дана строка с текстом поста. Разбить её на слова через split(),
# вывести количество слов и первое слово в верхнем регистре (upper()).

text_post = "Ману́л — хищное млекопитающее семейства кошачьих. Внешностью и размерами похож на домашнего кота, но отличается более короткими массивными туловищем и лапами, круглыми зрачками, низкими ушами, а также длинным густым мехом. Длина головы и туловища составляет от 46 до 65 см, длина хвоста — от 21 до 31 см, масса составляет 2—5 кг. Мех манула — самый пушистый и густой среди кошачьих, имеет неравномерный окрас, обычно серого цвета, а на отдельных частях тела — рыжеватого или охристого."
new_text = text_post.split()

print(new_text)
print(len(new_text))
print(new_text[0].upper())


