#Агрегация «баллы за курс».** Дан словарь `scores` с баллами по курсам (не менее 4 курсов).
# Напишите цикл по `items()`, который: - выведет каждую пару в формате `курс: балл`;
# - посчитает сумму баллов; - через `get()` выведет значение для курса, которого в словаре нет, с запасным текстом.

scores = {
    "Русский язык": 43,
    "География": 76,
    "История": 56,
    "Математика": 99,
    "Химия": 85,
}

#Написать цикл по `items()`, который: - выведет каждую пару в формате `курс: балл`
#и подсчитает сумму баллов
total = 0
for course, score in scores.items():
    print(f"{course}: {score}")
    total += score

print(f"Общая сумма баллов по всем предметам: {total}")

#Через `get()` вывести значение для курса, которого в словаре нет, с запасным текстом.
print(scores.get("Английский язык", "Такого курса нет"))
