#Словарь «профиль». Создайте словарь с данными пользователя (имя, возраст, город, профессия).
# Затем: выведите значение по ключу и через get() с запасным значением;
#проверьте через in, есть ли в словаре ключ "phone";
#добавьте ключ "email" и измените значение "age";
#удалите один ключ через pop и выведите получившийся словарь.

from pprint import pprint

user = {
    "name": "Алена",
    "age": 42,
    "city": "Нижний Новгород",
    "profession": "руководитель отдела контента",
}

#Вывести значение по ключу и через get() с запасным значением
print(user["city"])
print(user.get("profession", "Не указана профессия"))

#Проверить через in, есть ли в словаре ключ "phone"
print(f"Есть ли в словаре телефон: {"phone" in user}")

#Добавить ключ "email" и изменить значение "age"
user["email"] = "alenavk.a@yandex.ru"
user["age"] = 39

#Удалить один ключ через pop и выведите получившийся словарь
user_age = user.pop("age")
pprint(user)
