#Множества: уникальные значения. Дан список тегов tags (с дублями).
#Составьте множество уникальных тегов через set, затем:
#проверьте, есть ли в нём конкретный тег через in;
#добавьте новый тег через add;
#удалите несуществующий тег через discard (без ошибки) и через remove в try/except — запишите, чем они отличаются, в комментарии.

tags = ["sql", "django",  "php", "python", "sql", "django", "python", "django", "sql", "c++", "python", "java", "django",]

#составьте множество уникальных тегов через set
unique_tags = set(tags)

#проверьте, есть ли в нём конкретный тег через in
print(f'Есть ли в множестве тег "python": {"python" in unique_tags}')

#добавьте новый тег через add
unique_tags.add("css")
print(unique_tags)

#удалите несуществующий тег через discard (без ошибки) и через remove в try/except — запишите, чем они отличаются, в комментарии.
unique_tags.discard("html")

try:
    unique_tags.remove("html")
except:
    print("Такого тега не существует")

#discard пытается удалить, если не получается - не выдает ошибку,
#remove пытается удалить, если не получается - выдает ошибку, что такого ключа нет
